In [56]:
import mysql.connector as base
import numpy  as np
import pandas as pd
import matplotlib.pyplot as plt
import ipywidgets as widgets

In [3]:
cnx = base.connect(user='cds', password='itsalldatababy', database='yelp_db')

In [4]:
c = cnx.cursor()

In [5]:
c.execute('SHOW TABLES;')
type_dict={}
for table in c.fetchall():
    c.execute('DESCRIBE {};'.format(table[0]))
    desc = c.fetchall()
    type_dict[table[0]] = pd.Series(["{} : {}".format(r[0], r[1]) for r in desc])
type_table=pd.DataFrame(type_dict).fillna("")
type_table

,attribute,business,category,checkin,elite_years,friend,hours,photo,review,tip,user
0,business_id : varchar(22),id : varchar(22),business_id : varchar(22),business_id : varchar(22),user_id : varchar(22),user_id : varchar(22),hours : varchar(255),id : varchar(22),id : varchar(22),user_id : varchar(22),id : varchar(22)
1,name : varchar(255),name : varchar(255),category : varchar(255),date : varchar(255),year : char(4),friend_id : varchar(22),business_id : varchar(22),business_id : varchar(22),stars : int(11),business_id : varchar(22),name : varchar(255)
2,value : text,neighborhood : varchar(255),,count : int(11),,,,caption : varchar(255),date : datetime,text : text,review_count : int(11)
3,,address : varchar(255),,,,,,label : varchar(255),text : text,date : datetime,yelping_since : datetime
4,,city : varchar(255),,,,,,,useful : int(11),likes : int(11),useful : int(11)
5,,state : varchar(255),,,,,,,funny : int(11),,funny : int(11)
6,,postal_code : varchar(255),,,,,,,cool : int(11),,cool : int(11)
7,,latitude : float,,,,,,,business_id : varchar(22),,fans : int(11)
8,,longitude : float,,,,,,,user_id : varchar(22),,average_stars : float
9,,stars : float,,,,,,,,,compliment_hot : int(11)
10,,review_count : int(11),,,,,,,,,compliment_more : int(11)
11,,is_open : tinyint(4),,,,,,,,,compliment_profile : int(11)
12,,,,,,,,,,,compliment_cute : int(11)
13,,,,,,,,,,,compliment_list : int(11)
14,,,,,,,,,,,compliment_note : int(11)
15,,,,,,,,,,,compliment_plain : int(11)
16,,,,,,,,,,,compliment_cool : int(11)
17,,,,,,,,,,,compliment_funny : int(11)
18,,,,,,,,,,,compliment_writer : int(11)
19,,,,,,,,,,,compliment_photos : int(11)

In [6]:
c.execute('SELECT column_name FROM information_schema.columns WHERE table_name="business";')
cols = [r[0] for r in c.fetchall()]

In [43]:
c.execute('SELECT * FROM business')
b = pd.DataFrame(c.fetchall(), columns=cols)
b.replace('', np.nan, inplace=True)

In [44]:
b.isnull().sum(axis=0)

id                  0
name                0
neighborhood    94403
address          5167
city                3
state               0
postal_code       553
latitude            1
longitude           1
stars               0
review_count        0
is_open             0
dtype: int64

In [49]:
def count_table(tab, col_ids, count=10):
    common_df = pd.DataFrame(index=range(0,count))
    for col in col_ids:
        tmp = tab[col].value_counts(dropna=False)
        common_df[col] = tmp.astype('str').radd(tmp.index.map(str) + ": ").reset_index(drop=True)
    return common_df

In [51]:
count_table(b, cols[1:], count=15)

,name,neighborhood,address,city,state,postal_code,latitude,longitude,stars,review_count,is_open
0,Starbucks: 892,nan: 94403,nan: 5167,Las Vegas: 24768,AZ: 47376,89109: 2812,36.175: 148,-111.926: 766,4.0: 31529,3: 23346,1: 132262
1,McDonald's: 645,Westside: 3237,5757 Wayne Newton Blvd: 87,Phoenix: 15656,NV: 30571,85251: 1882,36.1697: 141,-111.927: 646,3.5: 28610,4: 16448,0: 24377
2,Subway: 607,Southeast: 3082,3200 Las Vegas Blvd S: 85,Toronto: 15483,ON: 26520,85281: 1657,33.5028: 135,-115.172: 619,5.0: 23818,5: 12279,NaN
3,Taco Bell: 286,The Strip: 2627,7014 E Camelback Rd: 75,Charlotte: 7557,NC: 11299,85260: 1585,33.4484: 129,-111.925: 521,4.5: 22557,6: 9681,NaN
4,Pizza Hut: 278,Spring Valley: 2405,3111 W Chandler Blvd: 73,Scottsdale: 7510,OH: 10930,89119: 1583,36.1286: 121,-111.929: 478,3.0: 21815,7: 7868,NaN
5,Walgreens: 272,Downtown: 2223,3500 Las Vegas Blvd S: 68,Pittsburgh: 5688,PA: 8916,89102: 1397,33.3831: 102,-112.074: 478,2.5: 13730,8: 6486,NaN
6,Burger King: 260,Ville-Marie: 2173,4400 Sharon Rd: 62,Montréal: 5175,QC: 7273,89103: 1287,36.1272: 100,-111.924: 447,2.0: 8331,9: 5599,NaN
7,Wendy's: 237,Scarborough: 1751,3799 Las Vegas Blvd S: 61,Mesa: 5146,WI: 4190,85308: 1238,36.1585: 96,-115.171: 421,1.5: 3516,10: 4696,NaN
8,The UPS Store: 212,Eastside: 1714,5000 S Arizona Mills Cir: 55,Henderson: 4130,EDH: 3561,85032: 1205,43.6532: 96,-115.207: 401,1.0: 2733,11: 4168,NaN
9,Tim Hortons: 209,Plateau-Mont-Royal: 1433,1300 W Sunset Rd: 55,Tempe: 3949,BW: 3071,89117: 1198,36.1148: 95,-115.243: 395,NaN,12: 3746,NaN
10,Domino's Pizza: 201,Downtown Core: 1381,3131 Las Vegas Blvd S: 55,Chandler: 3649,IL: 1667,85016: 1187,33.45: 95,-111.94: 380,NaN,13: 3299,NaN
11,Great Clips: 182,Southwest: 1187,3355 Las Vegas Blvd S: 54,Edinburgh: 3625,SC: 583,89118: 1155,43.6654: 94,-115.136: 359,NaN,14: 2892,NaN
12,Enterprise Rent-A-Car: 181,Etobicoke: 1160,5501 Josh Birmingham Pkwy: 51,Cleveland: 2979,MLN: 185,85254: 1145,36.144: 90,-111.928: 355,NaN,15: 2630,NaN
13,Dunkin' Donuts: 173,Chinatown: 1031,3000 Paradise Rd: 45,Madison: 2891,HLD: 175,89123: 1073,33.6399: 89,-112.065: 350,NaN,16: 2374,NaN
14,Chipotle Mexican Grill: 171,Anthem: 992,7700 W Arrowhead Towne Ctr: 45,Glendale: 2841,FIF: 73,89014: 1070,33.6398: 87,-115.244: 347,NaN,17: 2206,NaN

In [55]:
count_table(b[b['stars'] >= 4.0], cols[1:], count=15)

,name,neighborhood,address,city,state,postal_code,latitude,longitude,stars,review_count,is_open
0,Starbucks: 220,nan: 47077,nan: 3930,Las Vegas: 13157,AZ: 25493,89109: 1277,36.1697: 86,-111.927: 405,4.0: 31529,3: 10717,1: 67701
1,QuikTrip: 85,Westside: 1887,3500 Las Vegas Blvd S: 40,Phoenix: 8264,NV: 16165,85251: 1159,36.1286: 80,-111.926: 403,5.0: 23818,4: 9112,0: 10203
2,Subway: 77,Southeast: 1591,7014 E Camelback Rd: 35,Toronto: 6572,ON: 10372,85260: 953,36.175: 74,-111.925: 294,4.5: 22557,5: 6425,NaN
3,Enterprise Rent-A-Car: 65,Spring Valley: 1456,3131 Las Vegas Blvd S: 34,Scottsdale: 4653,NC: 5266,85281: 868,33.4484: 69,-112.074: 278,NaN,6: 4774,NaN
4,Public Storage: 61,Downtown: 1201,3200 Las Vegas Blvd S: 33,Charlotte: 3520,OH: 5112,89117: 756,33.5028: 68,-111.929: 276,NaN,7: 3807,NaN
5,The UPS Store: 59,The Strip: 1190,4400 Sharon Rd: 29,Pittsburgh: 2830,PA: 4322,89102: 735,36.1148: 65,-115.172: 265,NaN,8: 3357,NaN
6,Chick-fil-A: 51,Ville-Marie: 1048,3799 Las Vegas Blvd S: 25,Montréal: 2826,QC: 3803,89118: 734,33.45: 63,-111.924: 263,NaN,9: 2770,NaN
7,Great Clips: 47,Plateau-Mont-Royal: 863,3355 Las Vegas Blvd S: 24,Mesa: 2589,WI: 2142,85254: 717,33.4986: 56,-115.207: 220,NaN,10: 2298,NaN
8,Walgreens: 41,Eastside: 748,3111 W Chandler Blvd: 23,Henderson: 2254,EDH: 2094,89119: 713,36.1585: 54,-115.243: 218,NaN,11: 2028,NaN
9,Anytime Fitness: 36,Southwest: 686,3708 Las Vegas Blvd S: 20,Edinburgh: 2134,BW: 1755,85016: 687,36.144: 53,-115.224: 215,NaN,12: 1837,NaN
10,European Wax Center: 36,Anthem: 582,1300 W Sunset Rd: 20,Tempe: 2089,IL: 731,89103: 641,33.4942: 52,-111.928: 212,NaN,13: 1587,NaN
11,Supercuts: 34,Scarborough: 580,3600 S Las Vegas Blvd: 20,Chandler: 1974,SC: 292,85308: 632,33.4952: 51,-115.171: 206,NaN,14: 1403,NaN
12,Five Guys: 34,Chinatown: 505,3663 Las Vegas Blvd S: 19,Gilbert: 1615,MLN: 102,89147: 631,43.6532: 50,-112.065: 206,NaN,15: 1262,NaN
13,Jersey Mike's Subs: 34,Northwest: 492,2502 E Camelback Rd: 19,Madison: 1482,HLD: 89,85032: 630,33.6072: 47,-111.94: 196,NaN,16: 1166,NaN
14,Firehouse Subs: 33,Downtown Core: 485,1979 W 25th St: 18,Cleveland: 1474,FIF: 33,89052: 629,33.4655: 46,-115.244: 194,NaN,17: 1031,NaN